Revit 2027 API
AnalyticalMember.GetReleaseType Method
 Gets the release type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReleaseType GetReleaseType(
	bool start
)
Public Function GetReleaseType (
	start As Boolean
) As ReleaseType
public:
ReleaseType GetReleaseType(
	bool start
)
member GetReleaseType :
        start : bool -> ReleaseType
Parameters
start Boolean
 The position on Analytical Member element. True for start, false for end.
Return Value
ReleaseType
 The type of release.
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace